day2/8_paraview/101PARAVIEW/yf17/c0/0_org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 250;

boundaryField
{
    fuselage
    {
        type            slip;
    }
    strake
    {
        type            slip;
    }
    wing
    {
        type            slip;
    }
    vertical-tail
    {
        type            slip;
    }
    horizontal-tail
    {
        type            slip;
    }
    intake
    {
        type            zeroGradient;

	//type		fixedValue;
	//value		uniform 250;  //252
    }
    intake-ramp
    {
        type            slip;
    }
    exhaust
    {
        type            fixedValue;
        value           uniform 250;
    }
    symmetry
    {
        type            symmetry;
    }
    side
    {
        type            fixedValue;
        value           uniform 250;
    }
    downstream
    {
        type            fixedValue;
        value           uniform 250;
    }
    upper
    {
        type            fixedValue;
        value           uniform 250;
    }
    lower
    {
        type            fixedValue;
        value           uniform 250;
    }
    upstream
    {
        type            fixedValue;
        value           uniform 250;
    }
}

// ************************************************************************* //
