day2/8_paraview/101PARAVIEW/yf17/c0/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    //default         Gauss linear;
    default         cellMDLimited Gauss linear 1;

    //default 	    leastSquares;
    //default 	    cellMDLimited Gauss linear 0.5;
    //default 	    cellMDLimited leastSquares 0.5;

    //grad(U)         cellLimited Gauss linear 1;

    //grad(U)         cellLimited Gauss linear 0.5;
    //grad(p)         cellLimited Gauss linear 0.5;
}

divSchemes
{
    default         none;
    //div(phi,U)      Gauss upwind;
    //div(phi,U)      Gauss limitedLinearV 1;
    div(phi,U)      Gauss linearUpwindV default;
    //div(phi,U)      Gauss SuperBeeV 1;

    div(phid,p)     Gauss limitedLinear 1;
    div(phiv,p)     Gauss limitedLinear 1;

    //div(phi,K)      Gauss limitedLinear 1;
    //div(phi,e)      Gauss limitedLinear 1;

    div(phi,K)      Gauss upwind;
    div(phi,e)      Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear 1;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.5;
}

// ************************************************************************* //
